//
//  cheatsheet.swift
//  ValeSwiftToolbox
//
//  Created by Валерия Пономарева on 04.02.2026.
//

import Foundation

/* ✅ RULES: -- add ONLY if:

 ✅ Использовала сама в 2+ реальных задачах
 ✅ Понимаю КАК работает и ЗАЧЕМ
 ✅ Не дублирует стандартный Swift
 ✅ Подписала: // Использовано в: задача 24, задача 26
    🚫  LIMIT: 1 файл, до 300 строк
    ❌ DELETE: раз в неделю удаляю неиспользуемое */


/* -- 🎯 STATE PATTERN -> Паттерн "Состояние" через Enum --

1. ESSENCE: Каждое состояние системы + его данные в одном месте
2. EXAMPLE: статус заказа, уровень пользователя, шаги процесса
3. USE: task 26 (ticket on airplan)
4. ✅ TYPE SAFE: compiler checks all states

enum BoardingStatus {
    case infant(age: Int)
    case adult(age: Int, hasTicket: Bool)
    
    var message: String {
        switch self {
        case .infant(let age):
            return "👶 Ребенок \(age) лет: билет не нужен"
        case .adult(let age, true):
            return "✅ Пассажир \(age) лет: проходите"
        case .adult(let age, false):
            return "❌ Пассажир \(age) лет: купите билет"
        }
    }
}
 */
